01  WS-AREA-1 PIC X(100). 
01  WS-AREA-2 PIC X(100). 
01  WS-NUMERIC-AREA PIC 9(5). 

PROCEDURE DIVISION. 
    MOVE '12345' TO WS-AREA-1 
    IF WS-AREA-1 NUMERIC THEN 
        MOVE WS-AREA-1 TO WS-NUMERIC-AREA
        DISPLAY WS-NUMERIC-AREA 
    ELSE 
        DISPLAY 'ERROR: Non-numeric data found'
    END-IF
    STOP RUN.